<?php

namespace Database\Seeders\TestsData\TestAnswers;

class KlimovTestAnswerSeeder extends TestAnswerSeeder
{
    private $answers = [
        [
            1 => [
                [
                    'text' => 'Ухаживать за животными.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обслуживать машины, приборы (следить, регулировать)',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Помогать больным людям, лечить их.',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Составлять таблицы, схемы, программы вычислительных машин.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Следить за качеством книжных иллюстраций, плакатов, художественных открыток, грампластинок.',
                    'test_base_codes' => ['man_art'],
                ],
            ],
            2 => [
                [
                    'text' => 'Следить за состоянием, развитием растений.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обрабатывать материалы (дерево, ткань, пластмассу и т.д.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Доводить товары до потребителя (рекламировать, продавать).',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Обсуждать научно-популярные книги, статьи.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Обсуждать художественные книги.',
                    'test_base_codes' => ['man_art'],
                ],
            ],
            3 => [
                [
                    'text' => 'Выращивать молодняк животных какой-либо породы.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Управлять каким-либо грузовым, подъёмным, транспорным средством (подъёмным краном, машиной и т.п.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Тренировать сверстников (или младших) в выполнении каких-либо действий (трудовых, учебных, спортивных).',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Копировать рисунки, изображения, настраивать музыкальные инструменты.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Сообщать, разъяснять людям нужные для них сведения в справочном бюро, во время экскурсии и т.д.',
                    'test_base_codes' => ['man_sign'],
                ],
            ],
            4 => [
                [
                    'text' => 'Художественно оформлять выставки, витрины, участвовать в подготовке концертов, пьес и т.п.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Ремонтировать изделия, вещи (одежду, технику), жилище.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Искать и исправлять ошибки в текстах, таблицах, рисунках.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Лечить животных.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Выполнять расчёты, вычисления.',
                    'test_base_codes' => ['man_sign'],
                ],
            ],
            5 => [
                [
                    'text' => 'Выводить новые сорта растений.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Конструировать новые виды промышленных изделий (машины, одежду, дома и т.д.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Разбирать споры, ссоры между людьми, убеждать, разъяснять, поощрять, наказывать.',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок).',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Наблюдать, изучать работу кружков художественной самодеятельности.',
                    'test_base_codes' => ['man_art'],
                ],
            ],
            6 => [
                [
                    'text' => 'Наблюдать, изучать жизнь микробов.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обслуживать, налаживать медицинские приборы и аппараты.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Оказывать людям медицинскую помощь при ранениях, ушибах, ожогах и т.п.',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Составлять точные описания, отчёты о наблюдаемых явлениях, событиях, измеряемых объектах и др.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Художественно описывать, изображать события наблюдаемые или представляемые.',
                    'test_base_codes' => ['man_art'],
                ],
            ],
            7 => [
                [
                    'text' => 'Делать лабораторные анализы в больнице.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Принимать, осматривать больных, беседовать с ними, назначать лечение.',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Красить или расписывать стены помещений, поверхность изделий.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Осуществлять монтаж здания или сборку машин, приборов.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Организовывать культ походы людей в театры, музеи, на экскурсии, в туристические путешествия и т.п.',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            8 => [
                [
                    'text' => 'Играть на сцене, принимать участие в концертах.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Изготовлять по чертежам детали, изделия (машины, одежду), строить здания.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Заниматься черчением, копировать карты, чертежи.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Вести борьбу с болезнями растений, с вредителями леса, сада.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Работать на машинах (пишущая машина, компьютер, телетайп, телефакс).',
                    'test_base_codes' => ['man_sign'],
                ],
            ],
            9 => [
                [
                    'text' => 'Следить за качеством книжных иллюстраций, плакатов, художественных открыток, грампластинок.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Следить за состоянием, развитием растений.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обслуживать машины, приборы (следить, регулировать)',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Обрабатывать материалы (дерево, ткань, пластмассу и т.д.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Доводить товары до потребителя (рекламировать, продавать).',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            10 => [
                [
                    'text' => 'Обсуждать научно-популярные книги, статьи.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Обсуждать художественные книги.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Выращивать молодняк животных какой-либо породы.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Управлять каким-либо грузовым, подъёмным, транспорным средством (подъёмным краном, машиной и т.п.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Тренировать сверстников (или младших) в выполнении каких-либо действий (трудовых, учебных, спортивных).',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            11 => [
                [
                    'text' => 'Копировать рисунки, изображения, настраивать музыкальные инструменты.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Сообщать, разъяснять людям нужные для них сведения в справочном бюро, во время экскурсии и т.д.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Художественно оформлять выставки, витрины, участвовать в подготовке концертов, пьес и т.п.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Ремонтировать изделия, вещи (одежду, технику), жилище.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Искать и исправлять ошибки в текстах, таблицах, рисунках.',
                    'test_base_codes' => ['man_sign'],
                ],
            ],
            12 => [
                [
                    'text' => 'Лечить животных.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Выполнять расчёты, вычисления.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Выводить новые сорта растений.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Конструировать новые виды промышленных изделий (машины, одежду, дома и т.д.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Разбирать споры, ссоры между людьми, убеждать, разъяснять, поощрять, наказывать.',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            13 => [
                [
                    'text' => 'Разбираться в чертежах, схемах, таблицах (проверять, уточнять, приводить в порядок).',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Наблюдать, изучать работу кружков художественной самодеятельности.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Наблюдать, изучать жизнь микробов.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обслуживать, налаживать медицинские приборы и аппараты.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Оказывать людям медицинскую помощь при ранениях, ушибах, ожогах и т.п.',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            14 => [
                [
                    'text' => 'Составлять точные описания, отчёты о наблюдаемых явлениях, событиях, измеряемых объектах и др.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Художественно описывать, изображать события наблюдаемые или представляемые.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Делать лабораторные анализы в больнице.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Принимать, осматривать больных, беседовать с ними, назначать лечение.',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Красить или расписывать стены помещений, поверхность изделий.',
                    'test_base_codes' => ['man_art'],
                ],
            ],
            15 => [
                [
                    'text' => 'Осуществлять монтаж здания или сборку машин, приборов.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Организовывать культ походы людей в театры, музеи, на экскурсии, в туристические путешествия и т.п.',
                    'test_base_codes' => ['man_man'],
                ],
                [
                    'text' => 'Играть на сцене, принимать участие в концертах.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Изготовлять по чертежам детали, изделия (машины, одежду), строить здания.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Заниматься черчением, копировать карты, чертежи.',
                    'test_base_codes' => ['man_sign'],
                ],
            ],
            16 => [
                [
                    'text' => 'Вести борьбу с болезнями растений, с вредителями леса, сада.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Работать на машинах (пишущая машина, компьютер, телетайп, телефакс).',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Ухаживать за животными.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обслуживать машины, приборы (следить, регулировать)',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Помогать больным людям, лечить их.',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            17 => [
                [
                    'text' => 'Составлять таблицы, схемы, программы вычислительных машин.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Следить за качеством книжных иллюстраций, плакатов, художественных открыток, грампластинок.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Следить за состоянием, развитием растений.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Обрабатывать материалы (дерево, ткань, пластмассу и т.д.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Доводить товары до потребителя (рекламировать, продавать).',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            18 => [
                [
                    'text' => 'Обсуждать научно-популярные книги, статьи.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Обсуждать художественные книги.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Выращивать молодняк животных какой-либо породы.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Управлять каким-либо грузовым, подъёмным, транспорным средством (подъёмным краном, машиной и т.п.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Тренировать сверстников (или младших) в выполнении каких-либо действий (трудовых, учебных, спортивных).',
                    'test_base_codes' => ['man_man'],
                ],
            ],
            19 => [
                [
                    'text' => 'Копировать рисунки, изображения, настраивать музыкальные инструменты.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Сообщать, разъяснять людям нужные для них сведения в справочном бюро, во время экскурсии и т.д.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Художественно оформлять выставки, витрины, участвовать в подготовке концертов, пьес и т.п.',
                    'test_base_codes' => ['man_art'],
                ],
                [
                    'text' => 'Ремонтировать изделия, вещи (одежду, технику), жилище.',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Искать и исправлять ошибки в текстах, таблицах, рисунках.',
                    'test_base_codes' => ['man_sign'],
                ],
            ],
            20 => [
                [
                    'text' => 'Лечить животных.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Выполнять расчёты, вычисления.',
                    'test_base_codes' => ['man_sign'],
                ],
                [
                    'text' => 'Выводить новые сорта растений.',
                    'test_base_codes' => ['man_nature'],
                ],
                [
                    'text' => 'Конструировать новые виды промышленных изделий (машины, одежду, дома и т.д.).',
                    'test_base_codes' => ['man_technics'],
                ],
                [
                    'text' => 'Разбирать споры, ссоры между людьми, убеждать, разъяснять, поощрять, наказывать.',
                    'test_base_codes' => ['man_man'],
                ],
            ],
        ],
    ];

    public function __construct()
    {
        return parent::__construct('klimov');
    }

    public function run(): void
    {
        $this->setAnswers($this->answers);
    }
}
