interface Faq {
    question: string;
    answer: string;
}

export const faq: Faq[] = [
    {
        question: 'Как система поможет мне в моей ситуации?',
        answer:
      'Система позволит найти более подходящие Вам виды занятостей. Занятость — ключ к Вашему будущем доходу. Проходите тесты и ищите занятости, которые подходят Вам на 90% и выше. Рекомендуется пройти как минимум 5 тестов.',
    },
    {
      question: 'Что влияет на моё соответствие занятости?',
      answer:
        '...',
    },
    {
      question: 'Как я могу управлять своими рекомендациями?',
      answer:
        '...',
    },
]