<?php

namespace Database\Seeders\TestsData\TestQuestions;

class YovayshiTestQuestionSeeder extends TestQuestionSeeder
{
    /**
     * [
     *    [
     *       Num => Question,      
     *    ],
     * ]
     */
    private $questions = [
        [
            1 => 'Представьте, что Вы на выставке. Что Вас больше привлекает в экспонатах:',
            2 => 'Какие черты характера в человеке Вам больше всего нравятся:',
            3 => 'Служба быта оказывает людям разные услуги. Считаете ли Вы необходимым:',
            4 => 'Какое награждение Вас больше бы обрадовало:',
            5 => 'Вы смотрите военный или спортивный парад. Что больше привлекает Ваше внимание:',
            6 => 'Представьте, что у Вас много свободного времени. Чем бы Вы охотнее занялись:',
            7 => 'Какую выставку Вы бы с большим удовольствием посмотрели:',
            8 => 'Если бы в школе было два кружка, какой бы Вы выбрали:',
            9 => 'Если бы Вам предоставили пост директора школы, на что бы Вы обратили большее внимание:',
            10 => 'Какие журналы Вы бы с большим удовольствием читали:',
            11 => 'Что важнее для человека:',
            12 => 'Для благополучия общества необходимо:',
            13 => 'Какую из двух книг Вы бы с большим удовольствием читали:',
            14 => 'В газете две статьи разного содержания. Какая из них вызвала бы у Вас большую заинтересованность:',
            15 => 'Какая из двух работ на свежем воздухе Вас больше бы привлекала:',
            16 => 'Какая, на Ваш взгляд, задача школы важнее:',
            17 => 'Что, на Ваш взгляд, следует больше ценить у участников самодеятельности:',
            18 => 'Какая, на Ваш взгляд, область деятельности человека в дальнейшем будет иметь доминирующее значение:',
            19 => 'Что обществу принесет больше пользы:',
            20 => 'Какого характера научную работу Вы бы выбрали:',
            21 => 'Представьте, что Вы - профессор университета. Чему Вы отдали бы предпочтение в свободное от работы время:',
            22 => 'Вам представляется возможность совершить путешествие в разные страны. В качестве кого Вы охотнее поехали бы:',
            23 => 'Какие лекции слушали бы Вы с большим удовольствием:',
            24 => 'Что Вас больше привлекает при чтении книг:',
            25 => 'Вам представляется возможность выбора профессии. Какой из них Вы бы отдали предпочтение:',
            26 => 'Какими выдающимися учеными Вы больше интересуетесь:',
            27 => 'Как Вам кажется, на что следовало бы в школе обратить большее внимание:',
            28 => 'Что бы Вас больше заинтересовало в печати:',
            29 => 'Если бы Вам представилась возможность занять определенный пост, какой бы Вы выбрали:',
            30 => 'Как Вы считаете, что важнее:',
        ],
    ];

    public function __construct()
    {
        return parent::__construct('yovayshi');
    }

    public function run(): void
    {
        $this->setQuestions($this->questions);
    }
}
